# Задача 30:  Заполните массив элементами 
# арифметической прогрессии. Её первый элемент, 
# разность и количество элементов нужно ввести 
# с клавиатуры. Формула для получения n-го члена 
# прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# Ввод: 1, 2, 5
# Вывод: 1, 3, 5, 7, 9

a1 = int(input("Введите первый элемент прогрессии: "))
d = int(input("Введите шаг прогрессии (разность элементов): "))
n = int(input("Введите кол-во элементов прогрессии: "))

otvet=[]
for i in range(1,n+1):
    otvet.append(a1 + (i-1) * d)
    
print(otvet)  
